IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCAN2_CFG_MCAN2_CFG.xml
	<register id="MCAN2_CFG_TXFQS" acronym="MCAN2_CFG_TXFQS" offset="0x2C4" width="32" description="">
		<bitfield id="TFQF" width="1" begin="21" end="21" resetval="0x0" description="Tx FIFO/Queue Full" range="21" rwaccess="RO"/> 
		<bitfield id="TFQPI" width="5" begin="20" end="16" resetval="0x0" description="Tx FIFO/Queue Put Index" range="20 - 16" rwaccess="RO"/> 
		<bitfield id="TFGI" width="5" begin="12" end="8" resetval="0x0" description="Tx Queue Get Index" range="12 - 8" rwaccess="RO"/> 
		<bitfield id="TFFL" width="6" begin="5" end="0" resetval="0x0" description="Tx FIFO Free Level" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN2_CFG_TXESC" acronym="MCAN2_CFG_TXESC" offset="0x2C8" width="32" description="">
		<bitfield id="TBDS" width="3" begin="2" end="0" resetval="0x0" description="Tx Buffer Data Field Size" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN2_CFG_TXBRP" acronym="MCAN2_CFG_TXBRP" offset="0x2CC" width="32" description="">
		<bitfield id="TRP" width="32" begin="31" end="0" resetval="0x0" description="Transmission Request Pending" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN2_CFG_TXBAR" acronym="MCAN2_CFG_TXBAR" offset="0x2D0" width="32" description="">
		<bitfield id="AR" width="32" begin="31" end="0" resetval="0x0" description="Add request" range="31 - 0" rwaccess="RW
	  			 W0TOCLR"/>
	</register>
	<register id="MCAN2_CFG_TXBCR" acronym="MCAN2_CFG_TXBCR" offset="0x2D4" width="32" description="">
		<bitfield id="CR" width="32" begin="31" end="0" resetval="0x0" description="Cancellation Request" range="31 - 0" rwaccess="RW
	  			 W0TOCLR"/>
	</register>
	<register id="MCAN2_CFG_TXBTO" acronym="MCAN2_CFG_TXBTO" offset="0x2D8" width="32" description="">
		<bitfield id="TO" width="32" begin="31" end="0" resetval="0x0" description="Transmission Occurred" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN2_CFG_TXBCF" acronym="MCAN2_CFG_TXBCF" offset="0x2DC" width="32" description="">
		<bitfield id="CF" width="32" begin="31" end="0" resetval="0x0" description="Cancellation Finished" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN2_CFG_TXBTIE" acronym="MCAN2_CFG_TXBTIE" offset="0x2E0" width="32" description="">
		<bitfield id="TIE" width="32" begin="31" end="0" resetval="0x0" description="Transmission Interrupt Enable" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN2_CFG_TXBCIE" acronym="MCAN2_CFG_TXBCIE" offset="0x2E4" width="32" description="">
		<bitfield id="CFIE" width="32" begin="31" end="0" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN2_CFG_RES14" acronym="MCAN2_CFG_RES14" offset="0x2E8" width="32" description="">
		
	</register>
	<register id="MCAN2_CFG_RES15" acronym="MCAN2_CFG_RES15" offset="0x2EC" width="32" description="">
		
	</register>
	<register id="MCAN2_CFG_TXEFC" acronym="MCAN2_CFG_TXEFC" offset="0x2F0" width="32" description="">
		<bitfield id="EFWM" width="6" begin="29" end="24" resetval="0x0" description="Event FIFO Watermark" range="29 - 24" rwaccess="RW"/> 
		<bitfield id="EFS" width="6" begin="21" end="16" resetval="0x0" description="Event FIFO Size" range="21 - 16" rwaccess="RW"/> 
		<bitfield id="EFSA" width="14" begin="15" end="2" resetval="0x0" description="Event FIFO Start Address" range="15 - 2" rwaccess="RW"/>
	</register>
	<register id="MCAN2_CFG_TXEFS" acronym="MCAN2_CFG_TXEFS" offset="0x2F4" width="32" description="">
		<bitfield id="TEFL" width="1" begin="25" end="25" resetval="0x0" description="Tx Event FIFO Element Lost" range="25" rwaccess="RO"/> 
		<bitfield id="EFF" width="1" begin="24" end="24" resetval="0x0" description="Event FIFO Full" range="24" rwaccess="RO"/> 
		<bitfield id="EFPI" width="5" begin="20" end="16" resetval="0x0" description="Event FIFO Put Index" range="20 - 16" rwaccess="RO"/> 
		<bitfield id="EFGI" width="5" begin="12" end="8" resetval="0x0" description="Event FIFO Get Index" range="12 - 8" rwaccess="RO"/> 
		<bitfield id="EFFL" width="6" begin="5" end="0" resetval="0x0" description="Event FIFO FIll Level" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN2_CFG_TXEFA" acronym="MCAN2_CFG_TXEFA" offset="0x2F8" width="32" description="">
		<bitfield id="EFAI" width="5" begin="4" end="0" resetval="0x0" description="Event FIFO Acknowledge Index" range="4 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN2_CFG_RES16" acronym="MCAN2_CFG_RES16" offset="0x2FC" width="32" description="">
		
	</register>
</module>